# getting to know your data

In [19]:
import pandas as pd
import numpy as np

In [12]:
len(user.columns)

5

In [13]:
user.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [14]:
user = pd.read_csv('/Users/manibhattarai/Desktop/Integrigy_assignments/Pandas_assignment/assignmet_file/u.user',sep='|')

###  See the first 5 entries

In [15]:
user.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

 ###  What is the number of observations in the dataset?

In [16]:
user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

 ### What is the number of columns in the dataset?

In [17]:
len(user.columns)

5

### Print the name of all the columns.

In [20]:
user.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### How is the dataset indexed?

In [21]:
user.index

RangeIndex(start=0, stop=943, step=1)

### What is datatype of each cloumn?

In [24]:
user.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

###  How many different occupation are in this dataset?

In [36]:
user['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [37]:
user['occupation'].value_counts().count()

21

### What is the most frequent occupation?

In [30]:
user['occupation'].value_counts().idxmax()

'student'

### Summarize the DataFrame.

In [31]:
user.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### Summarize all the columns

In [40]:
user.describe(include='all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

### Summarize only the occupation column

In [41]:
user.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### What is the age with least occurrence?

In [39]:
user['age'].value_counts().tail(10)

58    3
64    2
68    2
69    2
62    2
11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

# Load Json file

## read a raw_nyc_phil.json data

In [49]:
from pandas.io.json import json_normalize
raw= pd.read_json('/Users/manibhattarai/Desktop/Integrigy_assignments/Pandas_assignment/assignmet_file/raw_nyc_phil.json')

In [63]:
new_raw = json_normalize(raw['programs'])
new_raw.head()

<ipython-input-63-95fedf4177d1>:1: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  new_raw = json_normalize(raw['programs'])

,season,orchestra,concerts,programID,works,id
0,1842-43,New York Philharmonic,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':...",3853,"[{'workTitle': 'SYMPHONY NO. 5 IN C MINOR, OP....",38e072a7-8fc9-4f9a-8eac-3957905c0002
1,1842-43,New York Philharmonic,"[{'Date': '1843-02-18T05:00:00Z', 'eventType':...",5178,[{'workTitle': 'SYMPHONY NO. 3 IN E FLAT MAJOR...,c7b2b95c-5e0b-431c-a340-5b37fc860b34
2,1842-43,Musicians from the New York Philharmonic,"[{'Date': '1843-04-07T05:00:00Z', 'eventType':...",10785,"[{'workTitle': 'EGMONT, OP.84', 'composerName'...",894e1a52-1ae5-4fa7-aec0-b99997555a37
3,1842-43,New York Philharmonic,"[{'Date': '1843-04-22T05:00:00Z', 'eventType':...",5887,"[{'workTitle': 'SYMPHONY NO. 2 IN D MAJOR, OP....",34ec2c2b-3297-4716-9831-b538310462b7
4,1843-44,New York Philharmonic,"[{'Date': '1843-11-18T05:00:00Z', 'eventType':...",305,"[{'workTitle': 'SYMPHONY NO. 7 IN A MAJOR, OP....",610a4acc-94e4-4cd6-bdc1-8ad020edc7e9

## Normalize a json data so that you get an output with columns

Date 	eventType 	Venue 	Location 	Time 	id 	orchestra 	programID 	season

In [77]:
data_work0= json_normalize(data=raw['programs'],record_path='concerts',meta=['id', 'orchestra','programID', 'season'])
data.head()

<ipython-input-77-37f4bf04c4dd>:1: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  data_work0= json_normalize(data=raw['programs'],record_path='concerts',meta=['id', 'orchestra','programID', 'season'])

,Date,eventType,Venue,Location,Time,id,orchestra,programID,season
0,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,38e072a7-8fc9-4f9a-8eac-3957905c0002,New York Philharmonic,3853,1842-43
1,1843-02-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,c7b2b95c-5e0b-431c-a340-5b37fc860b34,New York Philharmonic,5178,1842-43
2,1843-04-07T05:00:00Z,Special,Apollo Rooms,"Manhattan, NY",8:00PM,894e1a52-1ae5-4fa7-aec0-b99997555a37,Musicians from the New York Philharmonic,10785,1842-43
3,1843-04-22T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,34ec2c2b-3297-4716-9831-b538310462b7,New York Philharmonic,5887,1842-43
4,1843-11-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",None,610a4acc-94e4-4cd6-bdc1-8ad020edc7e9,New York Philharmonic,305,1843-44

## Normalize a json data to get an output with columns :

soloistName 	soloistRoles 	soloistInstrument 	id

In [78]:
new_data_work1= json_normalize(data=raw['programs'],record_path=['works','soloists'],meta=['id'])
new_data_work.head()

<ipython-input-78-9298f512c05b>:1: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  new_data_work1= json_normalize(data=raw['programs'],record_path=['works','soloists'],meta=['id'])

,soloistName,soloistRoles,soloistInstrument,id,concerts
0,"Otto, Antoinette",S,Soprano,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
1,"Scharfenberg, William",A,Piano,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
2,"Hill, Ureli Corelli",A,Violin,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
3,"Derwort, G. H.",A,Viola,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
4,"Boucher, Alfred",A,Cello,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."

## Normalize a json to get an output with columns
soloistName 	soloistRoles 	soloistInstrument 	id 	orchestra 	programID 	season 	 	Date 	eventType 	Venue 	Location 	Time

In [79]:
new_data_work= json_normalize(data=raw['programs'],record_path=['works','soloists'],meta=['id','concerts'])
new_data_work.head()

<ipython-input-79-385e9ed9b03f>:1: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  new_data_work= json_normalize(data=raw['programs'],record_path=['works','soloists'],meta=['id','concerts'])

,soloistName,soloistRoles,soloistInstrument,id,concerts
0,"Otto, Antoinette",S,Soprano,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
1,"Scharfenberg, William",A,Piano,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
2,"Hill, Ureli Corelli",A,Violin,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
3,"Derwort, G. H.",A,Viola,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
4,"Boucher, Alfred",A,Cello,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."

In [83]:
work_data= pd.concat([data_work0,new_data_work1])
work_data.head(20)

,Date,eventType,Venue,Location,Time,id,orchestra,programID,season,soloistName,soloistRoles,soloistInstrument
0,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,38e072a7-8fc9-4f9a-8eac-3957905c0002,New York Philharmonic,3853,1842-43,NaN,NaN,NaN
1,1843-02-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,c7b2b95c-5e0b-431c-a340-5b37fc860b34,New York Philharmonic,5178,1842-43,NaN,NaN,NaN
2,1843-04-07T05:00:00Z,Special,Apollo Rooms,"Manhattan, NY",8:00PM,894e1a52-1ae5-4fa7-aec0-b99997555a37,Musicians from the New York Philharmonic,10785,1842-43,NaN,NaN,NaN
3,1843-04-22T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,34ec2c2b-3297-4716-9831-b538310462b7,New York Philharmonic,5887,1842-43,NaN,NaN,NaN
4,1843-11-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",None,610a4acc-94e4-4cd6-bdc1-8ad020edc7e9,New York Philharmonic,305,1843-44,NaN,NaN,NaN
5,1844-01-13T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,47b6e9e8-3b18-49ea-ae2a-b9b0ca18902c,New York Philharmonic,3368,1843-44,NaN,NaN,NaN
6,1844-03-16T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",None,5e533e4f-d4ac-4aaa-b8d2-e189f6806655,New York Philharmonic,4226,1843-44,NaN,NaN,NaN
7,1844-05-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",None,7550f75e-5c0c-4519-9196-05a6c4e2612c,New York Philharmonic,5087,1843-44,NaN,NaN,NaN
8,1844-11-16T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,91f716fc-090d-4c3b-85da-41122eb3fe96,New York Philharmonic,6310,1844-45,NaN,NaN,NaN
9,1845-01-11T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,253d22e1-9d44-410c-ae06-61abe434e5ec,New York Philharmonic,1979,1844-45,NaN,NaN,NaN
10,1845-03-01T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,6285c981-8e21-4ef1-afb2-634844dd7edb,New York Philharmonic,2821,1844-45,NaN,NaN,NaN
11,1845-04-19T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,bd29d7be-ee14-4362-ae93-4d9c8a535804,New York Philharmonic,3259,1844-45,NaN,NaN,NaN
12,1845-11-22T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,4b37d068-0d4b-4ba8-8885-5abefa261e91,New York Philharmonic,4919,1845-46,NaN,NaN,NaN
13,1846-01-17T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,119e0eaf-077f-49f2-b396-6f7b179fe2d8,New York Philharmonic,562,1845-46,NaN,NaN,NaN
14,1846-03-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,676bc63e-0f45-49cd-af5a-f36c31e986a1,New York Philharmonic,1408,1845-46,NaN,NaN,NaN
15,1846-04-25T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,fb00e4fb-d935-4b13-aa85-06a4d8d89a16,New York Philharmonic,1851,1845-46,NaN,NaN,NaN
16,1846-05-20T05:00:00Z,Special,Castle Garden,"Manhattan, NY",None,7f9997cb-c3a4-4fc5-b241-2348944ef999,New York Philharmonic,2321,1845-46,NaN,NaN,NaN
17,1846-11-21T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,a7ac4233-c065-41e7-9a36-9a5e3f5daa7b,New York Philharmonic,3540,1846-47,NaN,NaN,NaN
18,1847-01-09T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,f93b6dcc-2657-44f6-a69d-0d1a5f9dd396,New York Philharmonic,6573,1846-47,NaN,NaN,NaN
19,1847-03-06T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,b0704cd5-728d-4886-8445-2b0edb1abeb6,New York Philharmonic,47,1846-47,NaN,NaN,NaN